ant-man21/orrery/rtos/esp32/sdkconfig.defaults
# Target: classic ESP32-WROOM-32 (USB-C devkit, single port -- no native
# USB peripheral on this chip, so flashing/console go over its UART-USB
# bridge chip; WiFi/BT still available for the planned internet link;
# JTAG for external J-Link debugging over the chip's fixed GPIO12-15).
CONFIG_IDF_TARGET="esp32"

# Give MotionTask's FPU-heavy double math and the future networking stack
# in CommTask room; matches the generous headroom the STM32 build used.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Task Watchdog: matches the STM32 IWDG's ~4s independent watchdog that
# resets the board if MotionTask ever stops refreshing it.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=4
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
